***** Exclude fasta map GC
:LOGBOOK:
CLOCK: [2021-12-08 Wed 10:58]--[2021-12-08 Wed 11:34] =>  0:36
CLOCK: [2021-12-08 Wed 10:08]--[2021-12-08 Wed 10:58] =>  0:50
CLOCK: [2021-11-29 Mon 12:44]--[2021-11-29 Mon 13:05] =>  0:21
:END:
#+begin_src snakemake
rule exclude_fasta_map_gc:
    input:
        bam = config["data_dir"] + "/bam/{library}_duke.bam",
        blacklist = config["data_dir"] + "/inputs/mathios_chrom_bins.bed",
    output:
        config["data_dir"] + "/bam/{library}_mathios.bam",
    shell:
        """
	bedtools intersect -a {input.bam} -b {input.blacklist} -v > {output}
        """
#+end_src
#+begin_src R
source(file.path(paste0("./config/", as.character(Sys.info()["nodename"]), ".R")))

chrom_bins = read.csv(file.path(data_dir,"inputs/mathios_keep.csv"), header = T)

chrom_bins

chrom_bins_exclude = chrom_bins %>%
  filter(gc < 0.3)

chrom_bins_exclude

library(dplyr)


#chrom_bins = read.csv(file.path(data_dir,"inputs/mathios_chrom_bins.csv"), header = T)

#+end_src



 To cap-
ture large-scale epigenetic differences in fragmentation across the genome estimable
from low-coverage whole-genome sequencing, we tiled the hg19 reference genome
into non-overlapping 5 Mb bins (Supplementary Table 12). Bins with an average
GC content <0.3 and an average mappability <0.9 were excluded, leaving 473 bins
spanning approximately 2.4 GB of the genome (Supplementary Table 11).
"

#+begin_src bash
sudo groupadd conda
sudo usermod -a -G conda jszymanski

#########1#########2#########3#########4#########5#########6#########7#########8

sudo chown -R jszymanski:conda /opt/mambaforge
sudo chmod -R 774 /opt/mambaforge

#########1#########2#########3#########4#########5#########6#########7#########8
source config/${HOSTNAME}.sh

conda install -c bioconda ucsc-fasplit

y

conda install -c bioconda seqkit
y

#########1#########2#########3#########4#########5#########6#########7#########8
if [ ! -f "${data_dir}/inputs/hg19.fa" ]; then gunzip -c "${data_dir}/inputs/hg19.fa.gz" "${data_dir}/inputs/hg19.fa"; fi

faSplit size ${data_dir}/inputs/hg19.fa 5000000 -oneFile /tmp/test.fa

seqkit fx2tab --name --header-line --gc /tmp/test.fa.fa > /tmp/res2

| awk -F "\t" '{if ($2 < 35) print $1}' | xargs -n 1 sh -c 'seqkit grep --pattern "$0" /tmp/test.fa.fa' > /tmp/results.fa


# https://www.biostars.org/p/9465609/
seqkit fx2tab --name --only-id --gc contigs.fa | awk -F "\t" '{if ($2 < 35) print $1}' | xargs -n 1 sh -c 'seqkit grep --pattern "$0" contigs.fa' > results.fa


Options:
    -verbose=2 - Write names of each file created (=3 more details)
    -maxN=N - Suppress pieces with more than maxN n's.  Only used with size.
              default is size-1 (only suppresses pieces that are all N).
    -oneFile - Put output in one file. Only used with size
    -extra=N - Add N extra bytes at the end to form overlapping pieces.  Only used with size.
    -out=outFile Get masking from outfile.  Only used with size.
    -lift=file.lft Put info on how to reconstruct sequence from
                   pieces in file.lft.  Only used with size and gap.
    -minGapSize=X Consider a block of Ns to be a gap if block size >= X.
                  Default value 1000.  Only used with gap.
    -noGapDrops - include all N's when splitting by gap.
    -outDirDepth=N Create N levels of output directory under current dir.
                   This helps prevent NFS problems with a large number of
                   file in a directory.  Using -outDirDepth=3 would
                   produce ./1/2/3/outRoot123.fa.
    -prefixLength=N - used with byname option. create a separate output
                   file for each group of sequences names with same prefix
                   of length N.

(base) jszymanski@aclm350:/drive3/users/jszymanski/repos/mpnst$
#+end_src


- https://github.com/mdshw5/pyfaidx/ -x command
- /tmp/test.fasta
- https://crashcourse.housegordon.org/split-fasta-files.html
- https://pythonhosted.org/pyfaidx/
- https://stackoverflow.com/questions/17060039/split-string-at-nth-occurrence-of-a-given-character/17060409
***** Filtered FASTA to frag summary
:LOGBOOK:
CLOCK: [2021-12-08 Wed 11:34]--[2021-12-08 Wed 12:05] =>  0:31
:END:

rule filtered_fasta_to_frag_summary:
    input:
        config["data_dir"] + "/bam/{library}_mathios.bam"
    output:
        config["data_dir"] + "/frag/{library}_frag.tsv"
    shell:
        """
        sambamba view -t CORES {input} \
        | awk -F'\t' |
        """

frag_filter(){
# Takes indexed bam. Returns bam with only fragments of specified range
# Input parameters:
#  $1 = input bam
#  $2 = output directory
#  $3 = lower fragment length
#  $4 = upper fragment length
#  $5 = number of cores used
# Steps
##
    ## Filter by absolute value of TLEN for each read
    sambamba view -t $5 $1 \
        | awk -F'\t' -v upper="$4" 'sqrt($9*$9) < upper {print $0}' \                                     |
        | awk -F'\t' -v lower="$3" 'sqrt($9*$9) > lower {print $0}' > $2/${base}_frag"${3}"_"${4}".nohead |
    ## Restore header
    samtools view -H $1 > $2/${base}_frag"${3}"_"${4}".onlyhead
    cat $2/${base}_frag"${3}"_"${4}".onlyhead $2/${base}_frag"${3}"_"${4}".nohead > $2/${base}_frag"${3}"_"${4}".sam
    ## Create filtered bam, sort, and index
    echo "$base fragment filtered, now re-sorting and indexing"
    sambamba view -t $5 -S -f bam $2/${base}_frag"${3}"_"${4}".sam > $2/${base}_frag"${3}"_"${4}".bam
    sambamba sort -t $5 -o $2/${base}_frag"${3}"_"${4}"_sorted.bam $2/${base}_frag"${3}"_"${4}".bam
    ## Clean up intermediate files
    rm -f $2/*.nohead
    rm -f $2/*.onlyhead
    rm -f $2/*.sam
    rm $2/${base}_frag"${3}"_"${4}".bam
}
